{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 128, 128, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "filters": 32, "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_2", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "filters": 32, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_3", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "filters": 64, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_4", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "kernel_regularizer": null, "filters": 64, "activation": "relu", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 512, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_3", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 24, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activation": "softmax"}}]}, "training_config": {"loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0005000000237487257, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07}}, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of27", "group1-shard2of27", "group1-shard3of27", "group1-shard4of27", "group1-shard5of27", "group1-shard6of27", "group1-shard7of27", "group1-shard8of27", "group1-shard9of27", "group1-shard10of27", "group1-shard11of27", "group1-shard12of27", "group1-shard13of27", "group1-shard14of27", "group1-shard15of27", "group1-shard16of27", "group1-shard17of27", "group1-shard18of27", "group1-shard19of27", "group1-shard20of27", "group1-shard21of27", "group1-shard22of27", "group1-shard23of27", "group1-shard24of27", "group1-shard25of27", "group1-shard26of27", "group1-shard27of27"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [53824, 512], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [512, 24], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [24], "dtype": "float32"}]}]}